## Plan for api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 11 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                   |
|----------|--------------------------------------------------------------------------|
| delete   | `module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda`       |
|          | `module.notify_slack.aws_iam_policy.notify_slack_lambda`                 |
|          | `module.notify_slack.aws_iam_role.notify_slack_lambda`                   |
|          | `module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda` |
|          | `module.notify_slack.aws_lambda_function.notify_slack`                   |
|          | `module.notify_slack.aws_lambda_permission.notify_slack[0]`              |
|          | `module.notify_slack.aws_lambda_permission.notify_slack[1]`              |
|          | `module.notify_slack.aws_lambda_permission.notify_slack[2]`              |
| recreate | `aws_sns_topic_subscription.critical`                                    |
|          | `aws_sns_topic_subscription.warning`                                     |
|          | `aws_sns_topic_subscription.warning_us_east`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic_subscription.critical must be replaced
-/+ resource "aws_sns_topic_subscription" "critical" {
      ~ arn                             = "arn:aws:sns:ca-central-1:762579868088:critical-alert-list-manager:8b9bec49-d37a-44b7-8aa8-acc43cc6629a" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ endpoint                        = (sensitive) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:762579868088:critical-alert-list-manager:8b9bec49-d37a-44b7-8aa8-acc43cc6629a" -> (known after apply)
      ~ owner_id                        = "762579868088" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ protocol                        = "lambda" -> "https" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.warning must be replaced
-/+ resource "aws_sns_topic_subscription" "warning" {
      ~ arn                             = "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager:78ac7255-6092-426c-a459-dd354d994d42" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ endpoint                        = (sensitive) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager:78ac7255-6092-426c-a459-dd354d994d42" -> (known after apply)
      ~ owner_id                        = "762579868088" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ protocol                        = "lambda" -> "https" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.warning_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "warning_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:762579868088:warning-alert-list-manager:661125ad-51d7-42c7-8934-b553439f0233" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ endpoint                        = (sensitive) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:762579868088:warning-alert-list-manager:661125ad-51d7-42c7-8934-b553439f0233" -> (known after apply)
      ~ owner_id                        = "762579868088" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ protocol                        = "lambda" -> "https" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda will be destroyed
  - resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:762579868088:log-group:/aws/lambda/notify_slack" -> null
      - id                = "/aws/lambda/notify_slack" -> null
      - name              = "/aws/lambda/notify_slack" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCenter" = "list-manager-production"
        } -> null
      - tags_all          = {
          - "CostCenter" = "list-manager-production"
        } -> null
    }

  # module.notify_slack.aws_iam_policy.notify_slack_lambda will be destroyed
  - resource "aws_iam_policy" "notify_slack_lambda" {
      - arn       = "arn:aws:iam::762579868088:policy/NotifySlackLambda-notify_slack" -> null
      - id        = "arn:aws:iam::762579868088:policy/NotifySlackLambda-notify_slack" -> null
      - name      = "NotifySlackLambda-notify_slack" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:762579868088:log-group:/aws/lambda/notify_slack"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA3DDKNLG4ASCD2JPBT" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.notify_slack.aws_iam_role.notify_slack_lambda will be destroyed
  - resource "aws_iam_role" "notify_slack_lambda" {
      - arn                   = "arn:aws:iam::762579868088:role/NotifySlackLambda-notify_slack" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-10-15T19:51:22Z" -> null
      - force_detach_policies = false -> null
      - id                    = "NotifySlackLambda-notify_slack" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::762579868088:policy/NotifySlackLambda-notify_slack",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "NotifySlackLambda-notify_slack" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-07-17T15:11:40Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3DDKNLG4H4ZTINVXM" -> null

      - inline_policy {}
    }

  # module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be destroyed
  - resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      - id         = "NotifySlackLambda-notify_slack-20211015195123087300000001" -> null
      - policy_arn = "arn:aws:iam::762579868088:policy/NotifySlackLambda-notify_slack" -> null
      - role       = "NotifySlackLambda-notify_slack" -> null
    }

  # module.notify_slack.aws_lambda_function.notify_slack will be destroyed
  - resource "aws_lambda_function" "notify_slack" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:762579868088:function:notify_slack" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel." -> null
      - filename                       = "/tmp/notify_slack.py.zip" -> null
      - function_name                  = "notify_slack" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "notify_slack" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:762579868088:function:notify_slack/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-10-15T19:51:37.261+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:762579868088:function:notify_slack:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:762579868088:function:notify_slack:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::762579868088:role/NotifySlackLambda-notify_slack" -> null
      - runtime                        = "python3.8" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "FipuaAUTHLWpYfowItg9o9BtNFUGbGVXXpLMyzFzTZY=" -> null
      - source_code_size               = 1595 -> null
      - tags                           = {
          - "CostCenter" = "list-manager-production"
        } -> null
      - tags_all                       = {
          - "CostCenter" = "list-manager-production"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "True"
              - "PROJECT_NAME"      = "ListManager"
              - "SLACK_WEBHOOK_URL" = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] will be destroyed
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify_slack" -> null
      - id            = "AllowExecutionFromSNS-notify_slack-0" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:762579868088:warning-alert-list-manager" -> null
      - statement_id  = "AllowExecutionFromSNS-notify_slack-0" -> null
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[1] will be destroyed
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify_slack" -> null
      - id            = "AllowExecutionFromSNS-notify_slack-1" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:us-east-1:762579868088:warning-alert-list-manager" -> null
      - statement_id  = "AllowExecutionFromSNS-notify_slack-1" -> null
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[2] will be destroyed
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify_slack" -> null
      - id            = "AllowExecutionFromSNS-notify_slack-2" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:762579868088:critical-alert-list-manager" -> null
      - statement_id  = "AllowExecutionFromSNS-notify_slack-2" -> null
    }

Plan: 3 to add, 0 to change, 11 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.api_waf,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "api_waf":
   1: resource "aws_wafv2_web_acl" "api_waf" {

Use rule_action_override instead

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.list_manager_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.every-three-minutes"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-above-maximum-latency-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-above-maximum-latency-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-invalid-auth-token-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-429-error-1-minute-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-5XX-error-1-minute-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-429-error-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-4xx-error-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-5XX-error-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-5-4xx-error-1-minute-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_list_manager_health_check"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.waf-block-request-warning"]
WARN -...
```

</details>
